[
    {
        "Crop name": "Chickpea",
        "Description" : "Chickpea, (Cicer arietinum), also called garbanzo bean or Bengal gram, annual plant of the pea family (Fabaceae), widely grown for its nutritious seeds. Chickpeas are an important food plant in India, Africa, and Central and South America. The seeds are high in fibre and protein and are a good source of iron, phosphorus, and folic acid.",
        "Img url": "https://images.app.goo.gl/ZTN97iMT1gSonQFN7",
        "Croptype": "Grain legume",
        "Sowing period":  "Winter",
        "Harvesting period": "Summer",
        "Sowing month": "mid October - mid november",
        "Harvesting month":  "February,March,April",
        "Weather suitable for the growth": "Chickpeas prefer warmer growing conditions — average temperatures below 15º C will reduce pollen viability and can cause flower drop, and average temperatures over 35º C will lower the potential yield and cause possible flower abortion. Therefore timing of sowing is very important for high yield harvests.",
        "Product link":"https://amzn.eu/d/c3mKUr8"
        },
        {
        "Crop name": "Plantain",
        "Description" : "Plantains are very versatile and typically inexpensive. They are always ready for cooking no matter what stage of ripeness—green, yellow, or black—and used in a variety of dishes, from appetizers to desserts. They just need to be peeled when raw.",
        "Img url": "https://images.app.goo.gl/aLAkt767bQTzpzw58",
        "Croptype": "Perennial crop",
        "Sowing period": "Autumn",
        "Harvesting period": "Summer",
        "Sowing month": "February-May",
        "Harvesting month": "October-April",
        "Weather suitable for the growth": "Plantain is more sensitive than ryegrass to sowing depth and soil temperature. It establishes best when sown into warm soils (10-12°C) at no greater than 10mm depth and where there is little competition from other plants in the first three months.",
        "Product link":"https://amzn.eu/d/0Daj0IF"
        },
        {
        "Crop name": "Tea",
        "Description" : "Camellia sinensis is a species of evergreen shrub or small tree in the flowering plant family Theaceae. Its leaves and leaf buds are used to produce the popular beverage, tea. Common names include tea plant, tea shrub, and tea tree.",
        "Img url": "https://images.app.goo.gl/QJsLrAxS1ffr398fA",
        "Croptype": "Plantation crop",
        "Sowing period": "Spring",
        "Harvesting period": "Summer",
        "Sowing month": "June - October",
        "Harvesting month": "March",
        "Weather suitable for the growth": "The most suitable condition of growing tea is average temperature between 12.5-13 degrees Celsius or more, and in winter time, the temperature do not stay –15 degrees Celsius or less for a long hours, 1500mm rains will be needed annually (especially between April to October, 1000mm rains will be needed).",
        "Product link":"https://amzn.eu/d/aszOmZ4"
        },
        {
        "Crop name": "Cardamom",
        "Description" : "Cardamom, sometimes cardamon or cardamum, is a spice made from the seeds of several plants in the genera Elettaria and Amomum in the family Zingiberaceae. Both genera are native to the Indian subcontinent and Indonesia.",
        
        "Img url": "https://images.app.goo.gl/nztErTGqb81zXion7",
        "Croptype": "Spice crop",
        "Sowing period": "Monsoon",
        "Harvesting period": "winter",
        "Sowing month": "June- July",
        "Harvesting month": "January - February",
        "Weather suitable for the growth": "The crop thrives well in regions which receive a well-distributed annual rainfall of 1500-2500 mm with a mean temperature of 15°C to 35°C and 600-1200 m above MSL. Cardamom grows luxuriantly in forest loam soils, which are generally acidic in nature with a pH range of 5.5-6.5.",
        "Product link":"https://amzn.eu/d/1OCq9wF"
        },
        {
        "Crop name": "Arecanut",
        "Description" : "The areca nut is the fruit of the areca palm, which grows in much of the tropical Pacific, South Asia, Southeast Asia, and parts of east Africa. It is commonly referred to as betel nut.",
        "Img url": "https://images.app.goo.gl/p5zkFUTteZrVQSmP7",
        "Croptype": "Tropical Crop",
        "Sowing period": "Monsoon",
        "Harvesting period": "Monsoon to Winter",
        "Sowing month": "May - June",
        "Harvesting month": "July - December",
        "Weather suitable for the growth": "The cultivation of arecanut is mostly confined to 28º north and south of the equator. It grows well within the temperature range of 14ºC and 36ºC and is adversely affected by temperatures below 10ºC and above 40ºC.",
        "Product link":"https://amzn.eu/d/5umYOA1"
        },
        {
        "Crop name": "Rubber",
        "Description" : "Rubber is a elastic substance obtained from the exudations of certain tropical plants (natural rubber) or derived from petroleum and natural gas (synthetic rubber). Because of its elasticity, resilience, and toughness, rubber is the basic constituent of the tires used in automotive vehicles, aircraft, and bicycles.",
        "Img url": "https://images.app.goo.gl/tt9bGRizBVXf2Zbg9",
        "Croptype": "Plantation Crop",
        "Sowing period": "Monsoon", 
        "Harvesting period": "Monsoon-Winter" ,
        "Sowing month": "June - July",
        "Harvesting month": "October - February",
        "Weather suitable for the growth": "Rubber grows optimally in areas with mean annual temperatures of 25°C–28°C and rainfall above 1,500 mm, with conditions in marginal areas being cooler, drier or both",
        "Product link":"https://amzn.eu/d/2qgs"
        },
        {
        "Crop name": "Pepper",
        "Description" :"Pepper is a flowering vine in the family Piperaceae, cultivated for its fruit, known as a peppercorn, which is usually dried and used as a spice and seasoning. The fruit is a drupe (stonefruit) which is about 5 mm (0.20 in) in diameter (fresh and fully mature), dark red, and contains a stone which encloses a single pepper seed. ",
        "Img url": "https://images.app.goo.gl/G4TreGTXWmnMScKa9",
        "Croptype": "Spice Crop",
        "Sowing period": "Monsoon",
        "Harvesting period": "Winter",
        "Sowing month":" June - July",
        "Harvesting month": "November - February",
        "Weather suitable for the growth":"Peppers are a warm season crop producing best within the range of 20o to 27o C. Peppers are very susceptible to light frosts and freezing tempera- tures. As such the crop must be transplanted after the last spring frost, normally end of May or early June.",
        "Product link":"https://amzn.eu/d/c7Osza1"
        },
        {
          "Crop name": "Nutmeg",
           "Description": "Nutmeg, a pungent and a warm, slightly sweet tasting spice, is used to flavor many kinds of baked goods, confections, puddings, potatoes, meats, sausages, sauces, vegetables, and such beverages as eggnog",
       "Img url":"https://cdn.britannica.com/77/170777-050-3A754B3D/Nutmeg-seeds-ground-spice.jpg?w=400&h=300&c=crop",
       "Croptype": "Nutmeg is the dried kernel of the seed",
       "Sowing period": "Summer to Winter ",
       "Harvesting period": "Summer to Winter ", 
       "Sowing month": "June -December",
         "Harvesting month": "June -August",
       "Weather suitable for the growth ": "Nutmeg thrives well in warm humid conditions in locations with an annual rainfall of 150 cm and more. It grows well up to about 1300 m above mean sea level",
        "Product link":"https://amzn.eu/d/gz6lSIm"
            },
        {
      "Crop name": "Cashew",
       "Description": "The cashew nut hangs from the end of the cashew apple, and is kidney-shaped and about 2.5 cm long. It consists of an edible kernel, surrounded by two shells. The outer shell is smooth and of a bright brown color. Between the two shells, there is a very caustic oily substance.",
         "Img url": "https://i.ndtvimg.com/i/2016-06/nuts_625x350_41464956952.jpg",
       "Croptype":  "Drupes",
       "Sowing period": "Sow the Cashew seed nuts are done after a rainfall",
         "Harvesting period": "Winter to Spring", 
         "Sowing month": "At the beginning of June till mid-July",
         "Harvesting month": "February-May",
         " Weather suitable for the growth": "The distribution of cashew is restricted to altitudes upto 700 m above mean sea level where the temperature does not fall below 20°C for prolonged period. Areas where the temperatures range from 20 to 30°C with an annual precipitation of 1000 - 2000 mm are ideal for cashew growing.",
        "Product link":"https://amzn.eu/d/jjHcnN3"
           },
        {
        "Crop name": "Sesame",
         "Description": "A widely cultivated chiefly tropical or subtropical annual erect herb (Sesamum indicum of the family Pedaliaceae) also its small seeds used especially as a source of oil and a flavoring agent.: open sesame",
         "Img url":  "https://i1.wp.com/credorganic.com/wp-content/uploads/2020/12/sesame-seeds-wooden-spoon.jpg?fit=1080%2C1080&ssl=1",
         "Croptype": "oldest indigenous oilseed crop",
         "Sowing period": "The optimum time of sowing for 1 sesame is second fortnight of February to first fortnight of March under summer irrigated conditions",
         "Harvesting period":"90-130 days",
         "Sowing month": "February",
         "Harvesting month": "April-May",
         " Weather suitable for the growth  ": "It can be cultivated up to the latitude of 1600m (India 1200 m). Sesame plant needs fairly high temperature during its life cycle. Normally the optimum temperature required during its life cycle is between 25 - 35 degree C. If the temperature is more than 40 degree C with hot winds the oil content reduces.",
        "Product link":"https://dl.flipkart.com/s/JyfqaguuuN"
           },
        {
        "Crop name": "Cocao",
         "Description": "Plant cocoa trees at the beginning of the rainy season. Choose a day when the soil is moist and when the sky is cloudy. Plant the young cocoa trees when they are about 6 months old.",
         "Img url": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/ts/20220107111224/ri/750/src/images/Article_Images/ImageForArticle_21829_16415719441098916.jpg",
         "Croptype": "tropical tree crop",
         "Sowing period": "Plant cocoa trees at the beginning of the rainy season.",
         "Harvesting period": "Around 6 months after the bloom and lasts from 10 to 14 days, between May and July, and then from October to March.",
         "Sowing month": "May",
         "Harvesting month": "September-January",
         " Weather suitable for the growth": "Cacao trees only prosper under specific conditions, including fairly uniform temperatures, high humidity, abundant rain, nitrogen-rich soil, and protection from wind. In short, cacao trees thrive in rainforests. Chocolate is now grown around the globe—typically within 10° north and south of the equator.",
        "Product link":"https://amzn.eu/d/dp7j8f3"
           },
        {
        "Crop name": "Soyabean",
         "Description":" The soybean is an erect branching plant and can reach more than 2 metres (6.5 feet) in height. The self-fertilizing flowers are white or a shade of purple.",
      "Img url":"https://www.commodityinsightsx.com/images/commodities/soyabean.jpg",
         "Croptype":" legume crop family",
         "Sowing period": "Optimum time of sowing is from mid of June to end of June subject to availability of soil moisture/rainfall",
         "Harvesting period": "Kharif Soybean is harvested during the period October – November and Rabi crops harvested in the month of January – February",
         "Sowing month": "June",
         "Harvesting month": "October -November",
         " Weather suitable for the growth": "Soybean grows well in warm and moist climate. A temperature of 26 to 30°C appears to be the optimum for most of the varieties. Soil temperatures of 15.5°C or above favor rapid germination and vigorous seedling growth. A lower temperature tends to delay the flowering.",
        "Product link":"https://amzn.eu/d/h4FB4wN"
           },
        {
        "Crop name": "Yam",
         "Description": " The edible starchy tuberous root of various plants (genus Dioscorea of the family Dioscoreaceae) used as a staple food in tropical areas. also : a plant producing yams. : a moist usually orange-fleshed sweet potato. ",
        "Img url": "https://images.healthshots.com/healthshots/en/uploads/2022/01/31210911/yam-770x433.jpg",
         "Croptype": "root/tuber crop",
         "Sowing period": "Yams are frost tender and so they need to be planted when the risk of frost has passed around October-November",
         "Harvesting period": "harvested in autumn, early winter after the first frost has knocked the tops and they start to die down.",
         "Sowing month": "October-November",
         "Harvesting month": "September",
         "Weather suitable for the growth ": "The tropical food species of Dioscorea grow in warm, sunny climates with temperatures between 25ºC and 30ºC. Short days of 10-11 h result in tuber formation, while days longer than 12 h favor vine growth. Yams require deep, loose, textured loamy soil that is rich in organic matter.",
        "Product link":"https://amzn.eu/d/gUT8RvS"
           },
        {
        "Crop name": "Potato",
         "Description": "The potato is a starchy food, a tuber of the plant Solanum tuberosum and is a root vegetable native to the Americas. The plant is a perennial in the nightshade family Solanaceae. Potato. Potato cultivars appear in a variety of colors, shapes, and sizes.",
         "Img url": "https://cdn.mos.cms.futurecdn.net/iC7HBvohbJqExqvbKcV3pP-970-80.jpg.webp",
         "Croptype": "Rabi crop",
         "Sowing period": "sown in winter between October and November",
         "Harvesting period": "Harvested in March",
         "Sowing month": "October-November",
         "Harvesting month": "March",
         " Weather suitable for the growth": "Potato is a temperate climate crop, however it grows under a diverse range of climatic conditions. It is grown only under such conditions where the temperature during the growing seasons is moderately cool. The vegetative growth of the plant is best at a temperature of 24°C while tuber development is favoured at 20°C.",
        "Product link":"https://amzn.eu/d/8FcxfRi"
           },
        {
        "Crop name": "Sorghum",
        "Description": "Sorghum is a strong grass and usually grows to a height of 0.6 to 2.4 metres (2 to 8 feet), sometimes reaching as high as 4.6 metres (15 feet).",
        "Img url":" https://5.imimg.com/data5/NY/EV/MY-11817306/sorghum-seeds-500x500.jpg",
        "Croptype": "Sorghum is grown in the kharif (rainy season) and rabi (post rainy season) but the share of kharif is higher both in terms of area under cultivation and production",
        "Sowing period": "Last week of May to2nd fortnight of July.",
        "Harvesting period": "Harvest their sorghum in September and October",
        "Sowing month": "May-July",
        "Harvesting month": "September-October",
        " Climatic condition suitable for the growth": "Sorghum requires about 26-30oC temperature for good growth. The minimum temperature for the germination of the sorghum seed is 7 to 10oC. Grain sorghum does not germinate and grow well under cool soil conditions. Poor emergence and seedling growth may result if planted before soil temperatures reach 35oC.",
        "Product link":"https://dl.flipkart.com/s/Yhqt1JNNNN"
        },
        {
        "Crop name": "Cumin",
        "Description": "The cumin, or comino, seeds are actually dry fruits known as schizocarps. They are thin yellowish brown elongated ovals about 6 mm (0.25 inch) long. Each features five prominent longitudinal dorsal ridges interspersed with less-distinctive secondary ridges forming a tiny gridlike pattern. ",
        "Img url": "https://cdn.britannica.com/59/219359-050-662D86EA/Cumin-Spice.jpg?w=400&h=300&c=crop",
        "Croptype": "Both Rabi and Kharif",
        "Sowing period":" Timely sowing of crop in between second week of October to first week of November.",
        "Harvesting period": "February to March",
        "Sowing month": "October- November",
        "Harvesting month": "February-March",
        "Weather suitable for the growth":" Cumin is a drought-tolerant, tropical, or subtropical crop. It has a growth duration of 100 − 120 days. Optimum temperature requirement is 20–30°C and it can grow in an annual rainfall range of 30 to 270 cms. Cumin is vulnerable to frost damage, especially at owering and early seed formation stages",
        "Product link":"https://dl.flipkart.com/s/JyMwuXuuuN"
        },
        {
        "Crop name": "Wheat",
        "Description": "Wheat is the main cereal crop in India. The total area under the crop is about 29.8 million hectares in the country. The production of wheat in the country has increased significantly from 75.81 million MT in 2006-07 to an all time record high of 94.88 million MT in 2011-12. The productivity of wheat which was 2602 kg/hectare in 2004-05 has increased to 3140 kg/hectare in 2011-12. The major increase in the productivity of wheat has been observed in the states of Haryana, Punjab and Uttar Pradesh. Higher area coverage is reported from MP in recent years.",
        "Img url": "https://m.media-amazon.com/images/I/714xCG6CxKL.SX466.jpg",
        "Croptype":" Rabi crop",
        "Sowing period": "Winter Season",
        "Harvesting period": "Spring season",
        "Sowing month": "October-December",
        "Harvesting month": "February -May",
        "Weather suitable for the growth":" The optimum temperature range for ideal germination of wheat seed is 20-25 C though the seeds can germinate in the temperature range 3.5 to 35 c. Rains just after sowing hamper germination and encourage seedling blight. Areas with a warm and damp climate are not suited for wheat growing.",
        "Product link":"https://amzn.eu/d/d32Db1N"
        },
        {
        "Crop name":  "Palm oil",
        "Description": "It's an edible vegetable oil that comes from the fruit of oil palm trees, the scientific name is Elaeis guineensis.Two types of oil can be produced; crude palm oil comes from squeezing the fleshy fruit, and palm kernel oil which comes from crushing the kernel, or the stone in the middle of the fruit.",
        
        "Img url":"https://media.istockphoto.com/id/489660706/photo/oil-palm-fruits-with-cooking-oil.jpg?s=612x612&w=0&k=20&c=Ne89ERUkw_oUzvdaQ-6QlvzyrD_WaWfMW-wsGuIkAEg=",
        
        "Croptype":"The palm kernel oil, obtained from the kernel of stony seed.",
        
        "Sowing period": "When it has about 15 green leaves, it is planted in the palm grove. The seedling is therefore 16 to 18 months old when it is ready to be planted in the palm grove.",
        
        "Harvesting period": "First harvest can be done 3.5 to 4 years after planting. Few ripe fruits are loose/fall off indicates the bunch is ready for harvest.In Young palms, Chisel harvesting is followed. If palms become taller (from 10th year onwards), then harvesting is done by hook.",
        
        "Sowing month": "  The best season for oil palm planting is from June to December.",
        
        "Harvesting month":" 3 years",
        
      "Climatic condition suitable for the growth ":" As reported by several studies, oil palm requires an annual average rainfall in the range 2,000–3,000 mm, more than 200 rainy days, a relative humidity between 75 and 80 percent, and an air temperature of 22–32 °C for its optimal growth and for flower and fruit development (Chantaraniyom, 2007).",
        "Product link":"https://amzn.eu/d/3GGu3V7"
        },
        {
        "Cropname":"Raggy",
        "Description":"It is a tetraploid and self-pollinating species probably evolved from its wild relative Eleusine africana.",
        "Img url":"https://naturallyyours.in/blogs/blog/10-health-benefits-of-ragi",
        "Croptype":"Zaid and kharif crop ",
        "Sowing period":"May to September",
        "Harvesting period": "Ragi matures 3-5 months after sowing",
        "Sowing month":"November and December",
        "Harvesting month":"April or May",
        "Climatic condition suitable for the growth" :"Ragi is a tropical crop and grows well in high temperature, moderate rainfall and dry regions.",
        "Product link":"https://amzn.eu/d/iQG8sMK"
        },
         {
        "Crop name": "Sweat Potato ",
        "Description":"The sweet potato or sweetpotato (Ipomoea batatas) is a dicotyledonous plant that belongs to the bindweed or morning glory family, Convolvulaceae. Its large, starchy, sweet-tasting tuberous roots are used as a root vegetable.",
        "Img url":"https://en.m.wikipedia.org/wiki/Sweet_potato#/media/File%3AIpomoea_batatas_006.JPG",
        "Croptype":"Kharif and Rabi ",
        "Sowing period":"January to February",
        "Harvesting period":"sweet potatoes can be harvested 110-120 days after planting",
        "Sowing month":"June – July ",
        "Harvesting month":"September",
        "Climatic condition suitable for the growth" :"Sweet potato requires a warm humid tropical climate with a mean temperature of about 22ºC",
        "Product link":"https://amzn.eu/d/9qEDazO"
        },
         {
        "Crop name":"Tapioca",
        "Description":"Tapioca is a starch extracted from the storage roots of the cassava plant a species native to the North ",
        "Img url":"https://garden.lovetoknow.com/tapioca-plants",
        "Croptype":"Tuber crop",
        "Sowing period":"April",
        "Harvesting period":"11-12 months",
        "Sowing month":"April ",
        "Harvesting month":"June – July; October – November",
        "Climatic condition suitable for the growth" :"It thrives best in tropical, warm humid climate with well distributed rainfall of over 100 cm per annum",
        "Product link":"https://dl.flipkart.com/s/JRXQQXuuuN"
        },
         {
        "Crop name": "Coffee", 
        "Description":"Coffee is a drink prepared from roasted coffee beans",
        "Img url":"https://en.m.wikipedia.org/wiki/Coffee_bean",
        "Croptype": "Plantation Crops",
        "Sowing period":"Seeds are sown in December - January",
        "Harvesting period":"2 to 3 months",
        "Sowing month":"December - January",
        "Harvesting month":"November to January",
        "Climatic condition suitable for the growth" :"Coffee is a tropical plant which is also grown in a semi-tropical climate",
        "Product link":"https://amzn.eu/d/cqSjof3"
        },
         {
        "Crop name":"Mustard ",
        "Description":"Mustard, condiment made from the pungent seeds of either of two main herbs belonging to the family Brassicaceae",
        "Img url":"https://rooturaj.com/dictionary/category/spices-1/meaning-of-RAI-in-english-8",
        "Croptype":"Oilseed crops.",
        "Sowing period":"September to October",
        "Harvesting period":"110 to 140 days",
        "Sowing month":"September to October",
        "Harvesting month":"February to March",
        "Climatic condition suitable for the growth":" Since mustard thrives in a dry, chilly climate, it is typically grown during the Rabi season",
        "Product link":"https://amzn.eu/d/ji4YfjX"
        },
        {
        "Crop name":"Groundnut",
        "Description":"Groundnut is raised in a sandy loam as well as well drained sandy clay loam soil",
        "Img url":"https://archive.dhakatribune.com/bangladesh/agriculture/2021/07/12/bumper-groundnut-production-likely-in-rangpur",
        "Croptype":"Oilseed crops ",
        "Sowing period":"From September second fort night to October second fort night is optimum for sowing",
        "Harvesting period":"110-120 days", 
        "Sowing month":"September 15 to October 15 ",
        "Harvesting month":"late October",
        "Climatic condition suitable for the growth":"The temperature of the area should be around 27-30˚C for good germination and growth",
        "Product link":"https://amzn.eu/d/0U1W3AD"
        },
        {
        "Crop name": "Coconut ",
        "Description":"The coconut tree (Cocos nucifera) is a member of the palm tree family (Arecaceae) and the only living species of the genus Cocos",
        "Img url":"https://www.ehow.com/facts_7670130_average-size-coconut-palm-tree.html",
        "Croptype":"Kharif Crops",
        "Sowing period":"Planting can be done during April also",
        "Harvesting period":"Eleven months old",
        "Sowing month":"May – June",
        "Harvesting month":"June - July, December – January",
        "Climatic condition suitable for the growth" :"Coconut is a tropical crop and grows well a hot climate",
        "Product link":"https://amzn.eu/d/9RsKurm"
        },
        {
        "Crop name":"Barley",
        
        "Description":"Barley, Hordeum vulgare, is an edible annual grass in the family Poaceae grown as a cereal grain crop. It is a tall grass with a hairy stem which stands erect and produces spikelets at the head. The stem is made up of nodes and internodes. The internodes are solid, whereas the internodes are hollow.",
        
        "Img url":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQbc_yu96wJcjNaHmsH2iqYANnE91Yh1YQPwYX2ePSKaxZmX7ujqUChmJfWFnBmbjzRsWo&usqp=CAU",
        
        "Croptype":"Cereal crop.",
        
        "Sowing period":"Barley is a rabi season crop. It should be sown between October and November.Row to row and plant to plant distance should be between 20-22.5 cm and 10-12 cm approximately.Sowing should always be done with the help of seed drill machine.",
        
        "Harvesting period": "Barley crop gets ready for harvest by the end of March to first fortnight of April.Since barley has shattering character, it should be harvested before over ripening to avoid breaking of spikes due to dryness.",
        
        "Sowing month":"Barley is a rabi season crop. It should be sown between October and November. Row to row and plant to plant distance should be between 20-22.5 cm and 10-12 cm approximately. Sowing should always be done with the help of seed drill machine.",
        
        "Harvesting month":"Barley crop gets ready for harvest by the end of March to first fortnight of April. Since barley has shattering character, it should be harvested before over ripening to avoid breaking of spikes due to dryness.",
        
      "Climatic condition suitable for the growth ": "Both tropical and subtropical climates are suitable for growing it. The crop needs temperatures of 12 to 15 °C for growth and 30 to 32 °C for maturity. At any stage of growth, the crop is particularly sensitive to frost.",
        "Product link":"https://amzn.eu/d/9BwJjXf"
        },
        {
        "Crop name": " Onion",
        
        "Description":  "An onion is a round vegetable with a brown skin that grows underground. It has many white layers on its inside which have a strong, sharp smell and taste. ",
        
        "Img url":"https://img.freepik.com/free-photo/red-onion-whole-isolated-white_146671-19175.jpg?w=2000",
        
        "Croptype":"Bulb crops",
        
        "Sowing period":" In the plains, seeds are sown in lines 30 cm apart during September-October.After sowing, hand hoeing is done to allow the seeds to reach to a depth of 2.5-3 cm.Hand watering or light irrigation is given immediately after covering the seeds.",
        
        "Harvesting period": "Indian onions has two crop cycles, first harvesting starts in November to January and the second harvesting from January to May. The onion is a hardy cool-season biennial but usually grown as annual crop. The onion has narrow, hollow leaves and a base which enlarges to form a bulb.",
        
        "Sowing month":   "Seeds are sown in lines 30 cm apart during September-October.After sowing, hand hoeing is done to allow the seeds to reach to a depth of 2.5-3 cm. Hand watering or light irrigation is given immediately after covering the seeds.",
        
        "Harvesting month": "Indian onions has two crop cycles, first harvesting starts in November to January and the second harvesting from January to May.",
        
      "Climatic condition suitable for the growth ": "The optimum temperature for vegetative phase and bulb development is 13-24˚C and 16-25˚C, respectively.It requires about 70% relative humidity for good growth. It can grow well in places where the average annual rainfall is 650-750 mm with good distribution during the monsoon period.",
        "Product link":"https://amzn.eu/d/cDs45ax"
        },
        {
        "Crop name":  "Sugar cane",
        
        "Description": "A sugarcane plant is a tuft of between 5 and 20 upright stems, or tillers, 2 to 5 metres tall and 2 to 4 centimetres in diameter. Each stem is a succession of nodes and internodes; each node bears a bud and a band of root primordia. The sugar is stored in the pith, under the hard, waxy bark.",
        
        "Img url": "https://cdn.shopify.com/s/files/1/0059/8835/2052/products/Sugar_Cane_3_FGT_650x.jpg?v=1623188327",
        
        "Croptype": "Rabi crops",
        
        "Sowing period": "After the monsoon rains",
        
        "Harvesting period": "onset of winter.",
        
        "Sowing month":   "Between early November and late December",
        
        "Harvesting month": "April / May",
        
      "Climatic condition suitable for the growth ": "It grows well in hot and humid climate with a temperature of 21°C to 27°C and an annual rainfall between 75cm",
        "Product link": "https://amzn.eu/d/aND3GHz"
        },
        {
        "Crop name": "Maize",
        
        "Description": "Maize (Zea mays L.) is the world's leading crop and is widely cultivated as cereal grain that was domesticated in Central America. It is one of the most versatile emerging crops having wider adaptability. Globally, maize is known as queen of cereals because of its highest genetic yield potential",
        
        "Img url": "https://www.shutterstock.com/image-photo/heap-raw-popcorn-grains-isolated-on-1807030114",
        
        "Croptype": "kharif Crop",
        
        "Sowing period": "Maize can be grown in all seasons monsoon post monsoon,winter and spring.",
        
        "Harvesting period": "Winter",
        
        "Sowing month":  "March-May",
        
        "Harvesting month": "December",
        
      "Climatic condition suitable for the growth ": "In India, maize is traditionally grown in monsoon (Kharif) season, which is accompanied by high temperature (<35° C) and rainfall. However, with the development of new cultivars and appropriate production technology, winter cultivation of maize has emerged as a viable alternative.",
        
        "Product link":"https://amzn.eu/d/edkHsaz"
        },
        {
        "Crop name": "Rice",
        
        "Description" : "Rice, (Oryza sativa), edible starchy cereal grain and the grass plant (family Poaceae) by which it is produced.Roughly one-half of the world population, including virtually all of East and Southeast Asia, is wholly dependent upon rice as a staple food; 95 percent of the world's rice crop is eaten by humans . ",
        
        "Img url": "https://images.unsplash.com/photo-1592997571659-0b21ff64313b?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Nnx8cmljZXxlbnwwfHwwfHw%3D&auto=format&fit=crop&w=600&q=60",
        
        "Croptype": "Kharif crop",
        
        "Sowing period":  "Winter",
        
        "Harvesting period": "Monsoon",
        
        "Sowing month": "June-July",
        
        "Harvesting month": "November-December",
        
        "Weather suitable for the growth": "Rice crop needs a hot and humid climate. It is best suited to regions which have high humidity, prolonged sunshine and an assured supply of water. The average temperature required throughout the life period of the crop ranges from 21 to 37º C. Maximum temp which the crop can tolerate 400C to 42 0C.",
        
        
        "Product link":"https://amzn.eu/d/cdrP2Nb"
        }
        
]